<?php 
// $Id: sort.php 2007-11-02 $
//  ------------------------------------------------------------------------ 
//                                杰奇网络                                     
//                    Copyright (c) 2004 jieqi.com                         
//                       <http://www.jieqi.com/>                           
//  ------------------------------------------------------------------------
//  设计：徐风(juny)
//  邮箱: 377653@qq.com
//  ------------------------------------------------------------------------
/**
 * FTP配置文件
 * 说明：
 * caption -- 选择项的标题
 * host    -- 主机地址
 * user    -- FTP用户名
 * pass    -- FTP密码
 * webroot -- 网站根目录，即站点保存的目录,相对于FTP默认连接目录而言，一般为"/"（说明：有的FTP默认连接的路径并非站点根目录,则此时应为"/实际网站根目录"）
 * path    -- 漫画保存路径(前面不需要再加网站根目录了，如"pic/cartoon/page")
 * ssl     -- 是否加密连接（一般默认为0）
 * timeout -- 连接超时
 * pasv    -- 是否被动模式（一般默认为1）
 * url     -- 此FTP对应的域名(网址)
 * publish -- 是否可用
*/

$jieqiFTP['cartoon'][0] = array('caption' => '正常上传', 'host' => '', 'port'=>'', 'user' => '', 'pass' => '', 'webroot' => JIEQI_ROOT_PATH,  'path' => 'files/cartoon/page', 'ssl' => '0', 'timeout' => '0',  'pasv' => '1', 'url' => '',  'publish' => '1');
